def pokebell(user_code):
    result = []
    code = [["0","ﾜ","ｦ","ﾝ","ﾞ","ﾟ","6","7","8","9"],
            ["E","ｱ","ｲ","ｳ","ｴ","ｵ","A","B","C","D"],
            ["J","ｶ","ｷ","ｸ","ｹ","ｺ","F","G","H","I"],
            ["O","ｻ","ｼ","ｽ","ｾ","ｿ","K","L","M","N"],
            ["T","ﾀ","ﾁ","ﾂ","ﾃ","ﾄ","P","Q","R","S"],
            ["Y","ﾅ","ﾆ","ﾇ","ﾈ","ﾉ","U","V","W","X"],
            ["/","ﾊ","ﾋ","ﾌ","ﾍ","ﾎ","Z","?","!","-"],
            ["☕︎","ﾏ","ﾐ","ﾑ","ﾒ","ﾓ","¥","&","□","☎︎"],
            [" ","ﾔ"," ","ﾕ"," ","ﾖ","*","#"," ","♡"],
            ["5","ﾗ","ﾘ","ﾙ","ﾚ","ﾛ","1","2","3","4"]]

    i = 0
    for _ in range(len(user_code) // 2):
        result.append(code[int(user_code[i])][int(user_code[i + 1])])
        i += 2

    return "".join(result)

print(pokebell("281037373080573048371968"))
print(pokebell("650524640493"))
